import picr1 from '../images/picture1.jpg';
import picr2 from '../images/picture2.jpg';
import picr3 from '../images/picture3.jpg';
import picr4 from '../images/picture4.jpg';
import picr5 from '../images/picture5.jpg';
import picr6 from '../images/picture6.jpg';
import picr7 from '../images/picture7.jpg';

const cases = [
	{
		name: "水利问题",
		date: "2019-6-22",
		picture: picr1,
		result: "取得重大成果树立家风代理商经费了第三季度防sdkjflkjsdlfjsljdflsjdfssjd sdfsfdsfds静电隆盛角色登录付款建设路口搭建公司的交流可该角色的管理技术的根据老师是多来几个了课设记得给是的罚款还是开的机会上课记得和各科室读后感可接受的根深蒂固科技分手了所发生的垃圾毒素了司法局水利附近乱非师范类健身房的。",
		solution: "通过严厉打击上课放款卡士大夫师生看到红富士康货到付款设计和福克斯的胡椒粉和第三款和富士康计划分点可视化付款。"

	},
	{
		name: "污染问题",
		date: "2019-7-22",
		picture: picr2,
		result: "广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司取得重大成果树立家风代理商经费了第三季度防静电隆盛科技分手了所发生的垃圾毒素了司法局水利附近乱非师范类健身房的。",
		solution: "通过严厉打击上课放款卡士大夫师生看到红富士康货到付款设计和福克斯的胡椒粉和第三款和富士康计划分点可视化付款。"

	},
	{
		name: "环境问题",
		date: "2019-3-22",
		picture: picr3,
		result: "取得重大成果树立家风代理商经费了第三季度防静电隆盛科技分手了所发生的垃圾毒素了司法局水利附近乱非师范类健身房的。",
		solution: "通过严厉打击上课放款卡士大夫师生看到红富士康货到付款设计和福克斯的胡椒粉和第三款和富士康计划分点可视化付款。"

	},
	{
		name: "水利问题",
		date: "2019-6-22",
		picture: picr4,
		result: "取得重大成果树立家风代理商经费了第三季度防静电隆盛科技分手了所发生的垃圾毒素了司法局水利附近乱非师范类健身房的。",
		solution: "通过严厉打击上课放款卡士大夫师生看到红富士康货到付款设计和福克斯的胡椒粉和第三款和富士康计划分点可视化付款。"

	},
	{
		name: "水利问题",
		date: "2019-6-22",
		picture: picr5,
		result: "取得重大成果树立家风代理商经费了第三季度防静电隆盛科技分手了所发生的垃圾毒素了司法局水利附近乱非师范类健身房的。",
		solution: "通过严厉打击上课放款卡士大夫师生看到红富士康货到付款设计和福克斯的胡椒粉和第三款和富士康计划分点可视化付款。"

	},
	{
		name: "水利问题",
		date: "2019-6-22",
		picture: picr6,
		result: "取得重大成果树立家风代理商经费了第三季度防静电隆盛科技分手了所发生的垃圾毒素了司法局水利附近乱非师范类健身房的。",
		solution: "通过严厉打击上课放款卡士大夫师生看到红富士康货到付款设计和福克斯的胡椒粉和第三款和富士康计划分点可视化付款。"

	},
	{
		name: "水利问题",
		date: "2019-6-22",
		picture: picr7,
		result: "取得重大成果树立家风代理商经费了第三季度防静电隆盛科技分手了所发生的垃圾毒素了司法局水利附近乱非师范类健身房的。",
		solution: "通过严厉打击上课放款卡士大夫师生看到红富士康货到付款设计和福克斯的胡椒粉和第三款和富士康计划分点可视化付款。"

	},
]
		
export function getCase( state = cases, action) {
	switch(action.type) {
		case 'GETCASE':
			return cases;
		default:
			return state;
	}
}