import picture1 from '../images/picture1.jpg';
import picture2 from '../images/picture2.jpg';
import picture3 from '../images/picture3.jpg';
import picture4 from '../images/picture4.jpg';


const whitebookText = [
	{
		name: "《建筑产业白皮书1》：建筑将成为拥有大脑的智慧平台",
		picture: picture1,
		bookDetail: "这是白皮书1广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州"
	},
	{
		name: "《建筑产业白皮书2》：建筑将成为拥有大脑的智慧平台",
		picture: picture2,
		bookDetail: "这是白皮书2广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州"
	},
	{
		name: "《建筑产业白皮书3》：建筑将成为拥有大脑的智慧平台",
		picture: picture3,
		bookDetail: "这是白皮书3广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州"
	},
	{
		name: "《建筑产业白皮书4》：建筑将成为拥有大脑的智慧平台",
		picture: picture4,
		bookDetail: "这是白皮书4广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州君和信息技术有限公司广州"
	},
]

export function getWhiteBook(state = whitebookText, action) {
	switch(action.type) {
		case 'GETWHITEBOOK':
			return whitebookText;
		default:
			return state;
	}
}